Revit 2027 API
PreviewControl.ScrollbarVisibility Property
 The visibility of the preview view scrollbars.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScrollbarVisibility ScrollbarVisibility { get; set; }
Public Property ScrollbarVisibility As ScrollbarVisibility
	Get
	Set
public:
property ScrollbarVisibility ScrollbarVisibility {
	ScrollbarVisibility get ();
	void set (ScrollbarVisibility value);
}
member ScrollbarVisibility : ScrollbarVisibility with get, set
Property Value
ScrollbarVisibility
See Also
Reference
PreviewControl Class
Autodesk.Revit.UI Namespace